export const ErrorCode = <const>{
  /**
   * Workload management system
   */
  W00: 'ERR-W00: ไม่สามารถเรียกดูรายชื่ออาจารย์ได้',
  W01: 'ERR-W01: ไม่สามารถเรียกดูภาระงานได้',
  W02: 'ERR-W02: ดาวน์โหลดไฟล์ไม่สำเร็จ',
  W03: 'ERR-W03: ดาวน์โหลดไฟล์ไม่สำเร็จ',
  W04: 'ERR-W04: ดาวน์โหลดไฟล์ไม่สำเร็จ',
  W05: 'ERR-W05: ไม่สามารถเรียกดูรายชื่ออาจารย์ได้',
  W06: 'ERR-W06: ไม่สามารถเรียกดูรายวิชาได้',
  W07: 'ERR-W07: ไม่สามารถเรียกดูห้องเรียนได้',
  W08: 'ERR-W08: ไม่สามารถเพิ่มข้อมูลได้',
  W09: 'ERR-W09: ไม่สามารถแก้ไขข้อมูลได้',
  W10: 'ERR-W10: ไม่สามารถลบข้อมูลได้',
  /**
   * Automatic room management system
   */
  R00: 'ERR-R00: ไม่สามารถเรียกดูห้องเรียนได้',
  R01: 'ERR-R01: ไม่สามารถเรียกดูภาระงานได้',
  R02: 'ERR-R02: ไม่สามารถเพิ่มข้อมูลได้',
  R03: 'ERR-R03: ไม่สามารถนำข้อมูลออกได้',
  R04: 'ERR-R04: จัดห้องอัตโนมัติล้มเหลว',
  R05: 'ERR-R05: รีเซตการจัดห้องล้มเหลว',
  R06: 'ERR-R06: ดาวน์โหลดไฟล์ไม่สำเร็จ',
  R07: 'ERR-R07: ไม่สามารถเรียกดูรายชื่ออาจารย์ได้',
  R08: 'ERR-R08: ไม่สามารถเรียกดูรายวิชาได้',
  R09: 'ERR-R09: ไม่สามารถเรียกดูห้องเรียนได้',
  R10: 'ERR-R10: ไม่สามารถเรียกดูวิชาสอนได้',
  R11: 'ERR-R11: ไม่สามารถเรียกดูรายชื่ออาจารย์ได้',
  R12: 'ERR-R12: ไม่สามารถเรียกดูรายวิชาได้',
  R13: 'ERR-R13: ไม่สามารถเรียกดูห้องเรียนได้',
  /**
   * Compensated book system
   */
  C00: 'ERR-C00: ไม่สามารถเรียกดูการสอนชดเชยได้',
  C01: 'ERR-C01: ไม่สามารถเรียกดูรายวิชาได้',
  C02: 'ERR-C02: ไม่สามารถเพิ่มการสอนชดเชยได้',
  C03: 'ERR-C03: ไม่สามารถลบการสอนชดเชยได้',
  C04: 'ERR-C04: ไม่สามารถเรียกดูห้องได้',
  C05: 'ERR-C05: ไม่สามารถเรียกดูห้องเรียนได้',
  C06: 'ERR-C06: ไม่สามารถเรียกดูภาระงานได้',
  /**
   * Assistant document system
   */
  A00: 'ERR-A00: ไม่สามารถเรียกดูรายวิชาได้',
  A01: 'ERR-A01: ไม่สามารถเรียกดูกลุ่มเรียนได้',
  A02: 'ERR-A02: ไม่สามารถแก้ไขข้อมูลTAได้',
  A03: 'ERR-A03: ดาวน์โหลดไฟล์ไม่สำเร็จ',
  /**
   * Auth
   */
  U00: 'ERR-U00: ออกจากระบบไม่สำเร็จ',
  U01: 'ERR-U01: ออกจากระบบไม่สำเร็จ',
  U02: 'ERR-U02: ลงชื่อเข้าใช้ไม่สำเร็จ',
  U03: 'ERR-U03: กรุณาลงชื่อเข้าใช้ใหม่อีกครั้ง',
  /**
   * Upload excel button
   */
  X00: 'ERR-X00: มีข้อผิดพลาดขณะอัปโหลดไฟล์',
  X01: 'ERR-X01: มีข้อผิดพลาดขณะอัปโหลดไฟล์',
  X02: 'ERR-X02: รูปแบบข้อมูลไม่ถูกต้อง',
  X03: 'ERR-X03: มีข้อผิดพลาดขณะอัปโหลดไฟล์',
  X04: 'ERR-X04: มีข้อผิดพลาดขณะอัปโหลดไฟล์',
  X05: 'ERR-X05: มีข้อผิดพลาดขณะอัปโหลดไฟล์',
}
