export const ErrorCode = <const>{
  /** Workload management system */
  W00: 'ERR-W00: ไม่สามารถเรียกดูรายชื่ออาจารย์ได้',
  W01: 'ERR-W01: ไม่สามารถเรียกดูภาระงานได้',
  W02: 'ERR-W02: ดาวน์โหลดไฟล์ไม่สำเร็จ',
  W03: 'ERR-W03: ดาวน์โหลดไฟล์ไม่สำเร็จ',
  W04: 'ERR-W04: ดาวน์โหลดไฟล์ไม่สำเร็จ',
  W05: 'ERR-W05: ไม่สามารถเรียกดูรายชื่ออาจารย์ได้',
  W06: 'ERR-W06: ไม่สามารถเรียกดูรายวิชาได้',
  W07: 'ERR-W07: ไม่สามารถเรียกดูห้องเรียนได้',
  W08: 'ERR-W08: ไม่สามารถเพิ่มข้อมูลได้',
  W09: 'ERR-W09: ไม่สามารถแก้ไขข้อมูลได้',
  W10: 'ERR-W10: ไม่สามารถลบข้อมูลได้',
}
